# AdvancedMetal Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedMetal Class
Members See Also
---
A static class that provides access to the property names that appear in the AdvancedMetal visual asset schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static class AdvancedMetal
```

Visual Basic
---
```text
Public NotInheritable Class AdvancedMetal
```

Visual C++
---
```text
public ref class AdvancedMetal abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..AdvancedMetal
# See Also
AdvancedMetal Members
Autodesk.Revit.DB.Visual Namespace